Revit 2026 API

# ConnectorElementWidth Property

---

The width of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual double Width { get; }
```
```vb
Public Overridable ReadOnly Property Width As Double
	Get
```
```cpp
public:
virtual property double Width {
	double get ();
}
```
```fsharp
abstract Width : float with get
override Width : float with get
```

#### Property Value

Double

#### Implements

IConnectorWidth

-1 if the connector is round.

#### Reference

ConnectorElement Class

Autodesk.Revit.DB Namespace